; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v1 - type_1 ?v7 - type_3)
 	      (pred_3 ?v2 - object ?v7 - type_3)
	      (pred_2 ?v1 - type_1 ?v6 - type_2)
	      (pred_1 ?v1 - type_1 ?v2 - object ?v6 - type_2))

   (:action op_3
       :parameters  (?v1 - type_1 ?v3 ?v5 - type_3)
       :precondition (and  (pred_4 ?v1 ?v3))
       :effect (and  (pred_4 ?v1 ?v5)
		     (not (pred_4 ?v1 ?v3))))

   (:action op_2
       :parameters (?v1 - type_1 ?v4 - object ?v8 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_3 ?v4 ?v8) (pred_4 ?v1 ?v8) (pred_2 ?v1 ?v6))
       :effect (and (pred_1 ?v1 ?v4 ?v6)
		    (not (pred_3 ?v4 ?v8)) 
		    (not (pred_2 ?v1 ?v6))))

   (:action op_1
       :parameters (?v1 - type_1 ?v4 - object ?v8 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_1 ?v1 ?v4 ?v6) (pred_4 ?v1 ?v8))
       :effect (and (pred_3 ?v4 ?v8)
		    (pred_2 ?v1 ?v6)
		    (not (pred_1 ?v1 ?v4 ?v6)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_06 obj_02 - type_1
obj_04 obj_05 obj_08 obj_11 - type_2
obj_01 obj_03 obj_07 - type_3
obj_10 obj_12 obj_09 - object)
(:init
(pred_4 obj_06 obj_07)
(pred_2 obj_06 obj_04)
(pred_2 obj_06 obj_05)
(pred_4 obj_02 obj_03)
(pred_2 obj_02 obj_08)
(pred_2 obj_02 obj_11)
(pred_3 obj_10 obj_01)
(pred_3 obj_12 obj_01)
(pred_3 obj_09 obj_03)
)
(:goal
(and
(pred_3 obj_10 obj_01)
(pred_3 obj_12 obj_07)
(pred_3 obj_09 obj_03)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_06 obj_07) (pred_4 obj_02 obj_07))))
  )
)
)

; plan
1. (op_3 obj_06 obj_07 obj_01)
   deleted: (pred_4 obj_06 obj_07)
   added: (pred_4 obj_06 obj_01)
   goals met: 2 of 3
2. (op_3 obj_02 obj_03 obj_01)
   deleted: (pred_4 obj_02 obj_03)
   added: (pred_4 obj_02 obj_01)
   goals met: 2 of 3
3. (op_2 obj_06 obj_12 obj_01 obj_05)
   deleted: (pred_3 obj_12 obj_01) (pred_2 obj_06 obj_05)
   added: (pred_1 obj_06 obj_12 obj_05)
   goals met: 2 of 3
4. (op_3 obj_06 obj_01 obj_07)
   deleted: (pred_4 obj_06 obj_01)
   added: (pred_4 obj_06 obj_07)
   goals met: 2 of 3
5. (op_1 obj_06 obj_12 obj_07 obj_05)
   deleted: (pred_1 obj_06 obj_12 obj_05)
   added: (pred_3 obj_12 obj_07) (pred_2 obj_06 obj_05)
   goals met: 3 of 3
